                                    //1
console.log(!(5 == 3))
console.log(!(3 >= 2))
console.log(!(9 < 2))
console.log(!(7 == 7))
console.log(!(2 > 0))
                                    //2
//შექმენით ცვლადი რომელშიც შეინახავთ 0-100 მდე რენდომ რიცხვს შემდეგ 
// კი გამოიტანეთ შეფასება თუ მაგალითად 90'დან 100'ის ჩათვლით ექნება ქულა 
// გამოუტანეთ "Grade A", თუ 80'დან 89'ის 
// ჩათვლით გამოუტანეთ "Grade B" და ა.შ.
const num = 15;
if(num <= 85 && num <= 100){
    console.log("Grade A")
}else if (num <= 60 && num <= 90){
    console.log("Grade B")
}
                                    //3
//შექმენით ცვლადი სადაც 10'ის ფარგლებში რანდომულად შეინახავთ რაღაც 
//რიცხვს თუ ეს რიცხვი მეტი 
//იქნება 5'ზე მაშინ დააბრუნეთ 
//ეს რიცხვი სხვა შემთხვევაში დააბრუნეთ მისი კვადრატი
let ricxvi = 9;
if(ricxvi < 5){
    console.log(ricxvi)
}else{
    console.log(ricxvi**2)
}
                                   //4
//შექმენით name ცვლადი სადაც შეინახავთ თქვენთვის სასურველ სახელს. 
// თუ სახელის სიგრძე მეტია 5'ზე გამოიტანეთ
// "this is my friend" სხვა შემთხვევაში დააბრუნეთ ეს სახელი.
let nam = "aleksa"
if(nam.length > 5){
    console.log("this is my friend")
}else{
    console.log(nam)
}