console.log(Math)
// ჩამოწერეთ დღეს ნასწავლი ყველა მეთოდი, კომენტარის სახით განმარტეთ და გააკეთეთ 2 მაგალითი თითოეულზე.
console.log(abs())//იგივე რაც მოდულები
console.log(min())//პოულობს მაგალითად ლისტში ყველაზე მინიმალურ ანუ პატარა რიცხვებს
console.log(max())//პოულობს ყველაზე მაქსიმალურ რიცხვებს
console.log(floor())//ამრგვალებს რიცხვებს იატაკამდე ანუ ყველაზე ქვევით
console.log(ceil())//ამრგვალებს რიცხვებს ჭერამდე ანუ მაღლა
console.log(random())//რანდომულად არჩევს რაიმე რიცხვებს ოღონდ ერთ მთელს
console.log(trunc())//აშორებს მთელის და წერტილის შემდეგ რიცხვებს

//შემთხვევითობის პრინციპით 10'ის ფარგლებში გამოიტანეთ რიცხვი შემდეგ კი დაამრგვალეთ 
console.log(floor(random(10)))
//აიღეთ ნებისმიერი უარყოფითი რიცხვი და გადაიყვანეთ დადებითში
console.log(abs(random(10)))
// დაბეჭდეთ 100'ის ფარგლებში რენდომული რიცხვი.
console.log(random(100))
//შექმენით ცვლადი სადაც შეიახავთ 5'ის ფარგლებში რენდომ რიცხვს,ეს რიცხვი დაამრგვალეთ "ზემოთ" და შემდეგ გამოიტანეთ ამ რიცხვის კვადრატი.
let cool = (cool.random(5).ceil())
console.log(cool.sqtr())
//შექმენით person ობიექტი, მასში შეინახეთ სახელი, გვარი და ასაკი რომელსაც აარჩევთ math.random()'ის მეშვეობით 20'ის ფარგლებში. აუცილებლად შეინახეთ მთელი რიცხვი შემდეგ კი დაბეჭდეთ ობიექტი.
let person = {
    name:"Alex",
    surname:"Gotsiridze",
    age:13,
}
console.log(person.Math(random))