    console.log(Math)                            
                                //1
            //შექმენით რიცხვების სია და ამ სიიდან გამოიტანეთ მაქსიმალური და მინიმალური მნიშვნელობები
console.log(Math.min(...[1,333,4,5,66,77,8,0]))
console.log(Math.max(...[1,333,4,5,66,77,8,0]))
                                //2
            //შემთხვევითობის პრინციპით 10'ის ფარგლებში გამოიტანეთ რიცხვი შემდეგ კი ამ რიცხვიდან გამოიტანეთ წერტილამდე მყოფი რიცხვი 
console.log(Math.trunc(Math.random(10)))
                                //3
            //აიღეთ ნებისმიერი უარყოფითი რიცხვი და გადაიყვანეთ დადებითში
let n = -5;
console.log(Math.abs(n))
                                //4
            //შექმენით ცვლადი სადაც შეინახავთ ათწილად რიცხვს შემდეგ ეს რიცხვი დაამრგვალეთ ჯერ მაღლა შემდეგ კი დაბლა.
let number = 10.2;
console.log(Math.ceil(num))
console.log(Math.floor(num))
                                //5
            // შექმენით ცვლადი, გადადაეცით რაღაც რიცხვი და დაბეჭდეთ იგი მე-4 ხარისხში. 
            