                                    //გაბო დუმბაძე
//აკლია ლევე 79 და 80 ანუ სულ ორი დღის დავალება

                                    //ნიკა ჭიტაძე
//აკლია ლეველ 13.5 ის classwork და ლეველ 16.5 ის homework 

                                    //მარიამ ჩაიძე
//აკლია ლეველ 100,101, და 102 ის დავალებე ანუ სულ აკლია 3 დღის დავალება

                                    //მათე პირანიშვილი
//აკლია ლეველ 59 ის classwork აგრეთვე ლეველ 65,66,67,68 და 69 ლეველები ანუ აკლია 5 დღის დავალება

                                    //ირაკლი ბუბუნაური 
//აკლია ლევლ 70-ის homework და 71-ის

                                    //ლუკა ნავერიანი
//აკლია ლეველ 98,99,100 და 101 ლეველები ანუ სულ აკლია 4 დღის დავალება

                                    //სანდრო ჯოჯუა
//აკლია მხოლოდ ლეველ 80 ანუ სულ ერთი დღის დავალება

                                    //ანდრია ჭანკვეტაძე
//აკლია ლეველ 96-ის classwork 

                                    //საბა დავითიძე
//აქვს ცუდი გითჰაბი რაშიც ალეველ 0-ის გარდა არაფერი უწერია

                                    //ნიკა ქორიძე
//აკლია ლეველ 15,16 და 17 ანუ სამი დღის დავალება

                                    //ზუკა ზუკა
//აკლია ლეველ 107,108,109 და 110 ანუ ოთხი დღის დავალება

                                    //ნიკოლოზ ლომიძე
//აკლია ლეველ 11.5-ის homework ასევე ლეველ 17

                                    //გიორგი ნარინდოშვილი
//აკლია ლეველ 102დან-110მდე ანუ სულ აკლია რვა ლეველი

                                    //ლუკა ყოჩიაშვილი
//აკლია მხოლოდ ლეველ 17

                                    //ლუკა ხაჩიძე
//აკლია ლეველ 33 და 34 ანუ აკლია ორი დღის დავალება

                                    //საბა გოგოლაძე
//აკლია ლეველ 33 და 34 ანუ აკლია ორი დღის დავალება


                                    //ნიკა ლომიძე
//აკლია ლეველ 33 და 34 ანუ აკლია ორი დღის დავალება


                                    //ანდრია ხმალაძე
//აქვს ყველაფერი შესრულებული და ატვირთული 

                                    //ნიკა ჯაფარიძე
//აკლია ლეველ 17

                                    //დათო ლომიაშვილი
//აკლია ლეველ 17

                                    //ბარბარე ჩიქობავა
//აქვს ყველაფერი შესრულებული და ატვირთული 

                                    //ნიკა ჭყოიძე
//აკლია ლეველ 109,110,111,112 და 113 ანუ სულ აკლია სამი ლეველი

                                    //მათე მაისურაძე
//აქვს ყველაფერი შესრულებული და ატვირთული

                                    //გიორგი ხორბალაძე
//აკლია ლეველ 17

