                                    //გაბო დუმბაძე
//აკლია ლეველ 78 ანუ ერთი დგის დავალება

                                    //ნიკა ჭიტაძე
//უწერია ყველა დავალება და აქვს ატვირთული

                                    //მარიამ ჩაიძე
//აკლია ლეველ 98,99 და 100 ანუ სამი რის დავალება

                                    //მათე პირანიშვილი
//აკლია ლეველ 59 ის classwork აგრეთვე ლეველ 66,67,68 ანუ სამი დღის დავალება

                                    //ირაკლი ბუბუნაური 
//აკლია ლევლ 66-ის classwork და ლეველ 68-ის homework აგრეთვე ლეველ 67,69 და 70ლეველი 

                                    //ლუკა ნავერიანი
//აკლია ლეველ 98 და 99 ანუ სულ აკლია 2 დგის დავალება

                                    //სანდრო ჯოჯუა
//აკლია მხოლოდ ლეველ 76 ანუ სულ ერთი დღის დავალება

                                    //ანდრია ჭანკვეტაძე
//აკლია ლეველ 96-ის classwork აგრეთვე 99დან-108მდე ანუ აკლია 9 დღის დავალება

                                    //საბა დავითიძე
//აქვს ყველაფერი შესრულებული და ატვირთული

                                    //ნიკა ქორიძე
//აკლია მხოლოდ ლეველ 15 ანუ ერთი დღის დავალება

                                    //ზუკა ზუკა
//აკლია ლეველ 107 და 108 ანუ აკლია ორი დღის დავალება

                                    //ნიკოლოზ ლომიძე
//აკლია ლეველ 11.5-ის homework

                                    //გიორგი ნარინდოშვილი
//აკლია ლეველ 100დან-108მდე ანუ სულ აკლია რვა ლეველი

                                    //ლუკა ყოჩიაშვილი
//აქვს ყველა დავალება შესრულებული და ატვირთული

                                    //ლუკა ხაჩიძე
//აკლია მხოლოდ ლეველ 31-ის homework

                                    //საბა გოგოლაძე
//აკლია მხოლოდ ლეველ 31-ის homework

                                    //ნიკა ლომიძე
//აკლია მხოლოდ ლეველ 31-ის homework

                                    //ანდრია ხმალაძე
//აქვს ყველაფერი შესრულებული და ატვირთული მაგრამ უბრალოდ აქვს შექმნილი ლეველ 12-ის ფოლდერი

                                    //ნიკა ჯაფარიძე
//აქვს ყველა დავალება შესრულებული და ატვირთული

                                    //დათო ლომიაშვილი
//აქვს ყველა დავალება შესრულებული და ატვირთული

                                    //ბარბარე ჩიქობავა
//აკლია მხოლოდ ლეველ 31-ის homework

                                    //ნიკა ჭყოიძე
//აკლია ლეველ 109,110 და 111 ანუ სულ აკლია სამი ლეველი

                                    //მათე მაისურაძე
//აქვს ყველაფერი შესრულებული და ატვირთული

                                    //გიორგი ხორბალაძე
//აქვს ყველაფერი შესრულებული და ატვირთული
